{"pistol":[{"name":"Glock-18","id":0,"desc":"Default pistol for Terrorists. This weapon is very good despite what you might think. Don't be tempted to buy something else on pistol rounds, the Glock-18 is generally better in every way. Opt for the Desert Eagle or P250 if you have really good aim. However, you should definitely pick up a USP-S if you find one. <i>Don't use the burst mode. Please.</i>","game":"The Glock 18 is a serviceable first-round pistol that works best against unarmored opponents and is capable of firing three-round bursts.","strategy":"Aim for the head, pace your shots at range, and spam when closer. If extremely close, you could use the burst mode. Trade it for a USP-S whenever you can.","stat":{"price":"$200","award":"$300","damage":"28","rpm":"400","ammo":"20/120","speed":"100%","accuracy":"20m","reload":"2.27s","armor":"47%","recover":"0.20s","range":"77.5m","headshot":"10.7m","helmet":"N/A"}},{"name":"USP-S","id":1,"desc":"Default pistol for Counter-Terrorists. This gun is far better than the P2000 in literally every way possible. Despite it's lower ammo capacity, you will almost never use it all. You're either bad enough to die before you even need to reload, or good enough that you won't have to reload. Also, this gun becomes WORSE than the P2000 in literally every way possible when you take the silencer off. DO NOT TAKE OFF THE SILENCER! It actually improves accuracy, reduces recoil, and eliminates tracer rounds.","game":"A fan favorite from Counter-Strike Source, the Silenced USP has a detachable silencer that gives shots less recoil while suppression attention-getting noise.","strategy":"Aim for the head, pace your shots at range, and spam when closer. Due to a smaller magazine and slower fire speed, you might consider aiming for body shots when very close. Never take off the silencer.","stat":{"price":"$200","award":"$300","damage":"35","rpm":"353","ammo":"12/24","speed":"100%","accuracy":"23.8m","reload":"2.17s","armor":"50.5%","recover":"0.30s","range":"77.5m","headshot":"34m","helmet":"N/A"}},{"name":"P2000","id":2,"desc":"A second option for the default Counter-Terrorist pistol. There is no reason to use this gun unless you are literally partially blind and can't possibly aim at someone's head. Use the USP-S instead, it does the same damage yet is more accurate. CS: GO is about headshots, so you should learn to get good at them by using the USP-S over this gun. Also, this gun takes 0.1s longer to reload than the USP-S.","game":"Accurate and controllable, the German-made P2000 is a serviceable first-round pistol that works best against unarmored opponents.","strategy":"Although you should use the USP-S instead, this gun is much better for spamming. Since it is already more inaccurate, you should spam when players are medium range or closer, and pace for headshots at long distances.","stat":{"price":"$200","award":"$300","damage":"35","rpm":"353","ammo":"13/52","speed":"100%","accuracy":"22m","reload":"2.27s","armor":"50.5%","recover":"0.30s","range":"77.5","headshot":"34m","helmet":"N/A"}},{"name":"Dual Berettas","id":3,"desc":"The only time in the game where you can hold two guns at once. Good for trolling the enemy team when you are 14-0, or when you've given up and want to annoy them with lucky headshots. These guns are literally identical to a semi-auto love-child between the Galil and the Glock-18, but with crippling damage falloff, horrible accuracy range, and a reload speed slower than every rifle except the AUG: they both have a reload speed of 3.77 seconds. There is no way to actually use the Dual Berettas in a serious manner, it's meant for joking around and humiliating your enemies.","game":"Firing two large-mag Berettas at once will lower accuracy and increase load times. On the bright side, you'll get to fire two large-mag Berettas at once.","strategy":"The accuracy is really bad, so just spam and aim for the upper chest. If you're lucky, a stray shot will hit them square in the face. Crouch walking in a train formation with your entire team wielding these bad boys is very effective and works more often than you might think.","stat":{"price":"$400","award":"$300","damage":"38","rpm":"500","ammo":"30/120","speed":"100%","accuracy":"17m","reload":"3.77s","armor":"57.5%","recover":"0.52s","range":"77.5m","headshot":"16.9m","helmet":"N/A"}},{"name":"P250","id":4,"desc":"Good primarily as a side-arm for snipers. Useful for Anti-ECOs on the Counter-Terrorist side due to increased armor penetration, when you know the Terrorists might not have helmets or rifles. It has an ammo capacity of 1 extra bullet over the USP-S, but much lower accuracy. It might be worth the buy for skilled players on the Terrorist side, but often not a better choice on the Counter-Terrorist side for most rounds.","game":"A low-recoil firearm with a high rate of fire, the P250 is a relatively inexpensive choice against armored opponents.","strategy":"Use this during Anti-ECOs if your opponents don't have helmets. Since you should be engaging enemies at closer ranges with this gun, you should aim for the head since it will kill them at most close ranges. Good for spamming corners to land a pre-fire headshot. Excellent side-arm choice for snipers, although the Five-SeveN may be better in some cases.","stat":{"price":"$300","award":"$300","damage":"38","rpm":"400","ammo":"13/26","speed":"100%","accuracy":"13.7m","reload":"2.27s","armor":"64%","recover":"0.35s","range":"77.5m","headshot":"37.9m","helmet":"N/A"}},{"name":"Tec-9","id":5,"desc":"A Terrorist only weapon, the Tec-9 has the fire-rate of the Dual Berettas, accuracy like the AK-47, and a slightly better damage output than the Five-SeveN. This gun is more viable viable now due to it's recent buff. A good choice for Anti-ECOs as a Terrorist, even if they have helmets and rifles! More accurate than the AK-47 when tap-fired and running, this can easily knock down opponents at medium range when you can't afford a rifle.","game":"An ideal pistol for the Terrorist on the move, the Tec-9 is lethal in close quarters and features a high magazine capacity.","strategy":"Use this during Anti-ECOs or ECOs on the Terrorist side. Since this gun is amazing at all ranges, you should aim for the head. Good for spamming corners to land a pre-fire headshot. You must tap fire at longer ranges due to high firing inaccuracy, but that's actually really good for the trained player.","stat":{"price":"$500","award":"$300","damage":"33","rpm":"500","ammo":"18/90","speed":"100%","accuracy":"22m","reload":"2.57s","armor":"90.6%","recover":"0.39s","range":"77.5m","headshot":"11.2m","helmet":"7.2m"}},{"name":"Five Seven","id":6,"desc":"A Counter-Terrorist only weapon, the Five-SeveN is an excellent all-around side arm. It might not have the damage potential of the Desert Eagle, but it's the next best choice. The Five-SeveN is like an upgraded P250, sporting very similar accuracy stats, more bullets, and more armor penetration.","game":"Highly accurate and armor-piercing, the pricey Five-Seven is a slow-loader that compensates with a generous 20-round magazine and forgiving recoil.","strategy":"Excellent for a general-use side-arm on the Counter-Terrorist side. Make use of it's low recoil and fast recovery time.","stat":{"price":"$500","award":"$300","damage":"32","rpm":"400","ammo":"20/100","speed":"100%","accuracy":"13.7m","reload":"2.27s","armor":"91.2%","recover":"0.20s","range":"77.5","headshot":"11.2m","helmet":"7m"}},{"name":"CZ75-Auto","id":7,"desc":"This used to have the title \"Pocket AK\" due to it's high fire rate, high damage, and plentiful magazines. Now, it's best use is to not be used at all. You only get 2 clips for this gun, and you'll plow through all the ammo in less than 10 seconds. Since it also has the slowest reload for a pistol and longest deploy time, this is only usable on ECO rounds to spam corners when you know someone is there. However, it really can turn the tables on your enemies should luck be on your side.","game":"A fully automatic variant of the CZ75, the CZ75-Auto is the ideal short-term choice for turning the tables and gaining your opponents weapon. But with very little ammo in the magazine, strong trigger discipline is required.","strategy":"This gun is a high risk/ high reward gamble. You have to rely on engaging only ONE enemy, two at most, at very close range, and hopefully outgunning them with an inaccuracy comparable to spamming the Desert Eagle.","stat":{"price":"$500","award":"$100","damage":"33","rpm":"600","ammo":"12/12","speed":"100%","accuracy":"11.4m","reload":"2.83s","armor":"77.7%","recover":"0.35s","range":"77.5m","headshot":"16.3m","helmet":"1.4m"}},{"name":"Desert Eagle","id":8,"desc":"Closer to a hand-cannon than a pistol, it makes you almost want to give this gun it's own classification. You'd think a gun with high damage, high accuracy, and high armor piercing sounds too good to be true, but that is everything the Desert Eagle is. With a headshot range comparable to some rifles, and high firing inaccuracy, this gun is deadliest in steady hands.","game":"As expensive as it is powerful, the Desert Eagle is an iconic pistol that is difficult to master but surprisingly accurate at long range.","strategy":"This is the only pistol where shooting less is preferred, as you only need one or two well placed shots to take down an enemy regardless of armoring. Timing and precision can make this deadlier than an AK-47 in the right hands. Use this like an AK-47, but say \"1 hospital, 2 hospital, 3...\" between shots, because that's where you'll be sending them.","stat":{"price":"$700","award":"$300","damage":"63","rpm":"267","ammo":"7/35","speed":"96%","accuracy":"24.6m","reload":"2.20s","armor":"93.2%","recover":"0.81s","range":"77.5m","headshot":"41.8m","helmet":"38.6m"}},{"name":"R8 Revolver","id":9,"desc":"As iNoToRiOuS puts it, this gun really is the \"Desert Eagle's stupid little brother.\" It used to be the only gun you'd need in matchmaking: it had the same stats as an AWP, but a longer trigger pull. But now it isn't worth it. Despite the stats listed here, it is actually slightly more inaccurate than the Desert Eagle due to the charging mechanic. Use the Desert Eagle.","game":"The R8 Revolver delivers a highly accurate and powerful round at the expense of a lengthy trigger-pull. Firing rapidly by fanning the hammer may be the best option when point-blank stopping power is required.","strategy":"Literally equip the Desert Eagle instead, there is no reason to use this gun as it stands right now.","stat":{"price":"$600","award":"$300","damage":"86","rpm":"120","ammo":"8/8","speed":"92%","accuracy":"24.9m","reload":"2.27s","armor":"93.2%","recover":"0.90s","range":"77.5m","headshot":"190m","helmet":"179m"}}],"heavy":[{"name":"Nova","id":27,"desc":"While shotguns aren't exactly the <i>professional's</i> weapon of choice, they have their uses in some cases. Specifically, hiding behind corners not often checked as a Counter-Terrorist and blasting enemies to pieces at close range. The Nova may be the all-around best option for this tactic.","game":"The Nova's rock-bottom price tag makes it a great ambush weapon for a cash-strapped team.","strategy":"I wrote my description before seeing the CS: GO description, and it seems we agree on strategy. Use this only when you are trying to ambush players as a Counter-Terrorist. If done well, you could turn the round in your favor in one planned, and maybe a little bit lucky, ambush. Aim for the stomach when using any shotgun, it increases your chances of landing hits.","stat":{"price":"$1200","award":"$900","damage":"26","rpm":"68","ammo":"8/32","speed":"92%","accuracy":"3.24m","reload":"4.74s","armor":"50%","recover":"0.46s","bullets":"9","range":"57.2m","headshot":"Unreliable","helmet":"Unreliable"}},{"name":"XM1014","id":28,"desc":"It's like the Nova's heavier big brother, sporting better accuracy and automatic firing at the cost of mobility and some damage. While the Nova is good for hiding behind corners, the XM1014 is good for clearing entire corridors. Done well, you could single-handedly hold back a full rush by firing down long hallways with an effective 1026RPM.","game":"The XM1014 is a powerful fully automatic shotgun that justifies its heftier price tag with the ability to pain a room with lead fast.","strategy":"Like in the description, this weapon is best used to clear corridors and small spaces. Flashing yourself in would be the best way to go about entering such an area, then just paint the room with lead.","stat":{"price":"$2000","award":"$900","damage":"20","rpm":"171","ammo":"7/32","speed":"90%","accuracy":"3.39m","reload":"4.22s","armor":"80%","recover":"0.51s","bullets":"6","range":"57.2m","headshot":"Unreliable","helmet":"Unreliable"}},{"name":"Sawed-Off","id":29,"desc":"For the Terrorist in close-quarters-combat, the Sawed-Off is a good choice. It has the highest damage out of all the shotguns, but with crippling damage falloff and incredibly short bullet range. You <i>literally</i> can't hit the broad side of <i>anything</i> from further than 12m away. It's all or nothing with this gun.","game":"The classic Sawed-Off deals very heavy close-range damage, but with its low accuracy, high spread and slow rate of fire, you'd better kill what you hit.","strategy":"You want to make sure you'll be really close to enemies before you buy this gun, because you could easily waste $1200 without ever even hitting a shot. You may not want to use this at all, both the Nova and XM1014 can do the same job with less risk.","stat":{"price":"$1200","award":"$900","damage":"32","rpm":"68","ammo":"7/32","speed":"88%","accuracy":"2.21m","reload":"4.22s","armor":"75%","recover":"0.46s","bullets":"8","range":"12.4m","headshot":"Unreliable","helmet":"Unreliable"}},{"name":"MAG-7","id":30,"desc":"Like the Sawed-Off, but better for the Counter-Terrorist. It has the second highest damage out of all the shotguns, better accuracy, and better range. Unlike the Terrorist Sawed-Off, this weapon is a good choice over the Nova or XM1014 in that it deals more damage with a significantly shorter reload time.","game":"The CT-exclusive Mag-7 delivers a devastating amount of damage at close ranges. Its rapid magazine-style reloads make it a great tactical choice.","strategy":"This is perhaps a better choice for ambushing than the Nova or XM1014, with higher damage and speedier reloads. If done right, you will surely take out unsuspecting Terrorists with this gun. This isn't the best for rushing, which you shouldn't really be doing anyway as a CT.","stat":{"price":"$1800","award":"$900","damage":"30","rpm":"71","ammo":"5/32","speed":"94%","accuracy":"2.21m","reload":"3.24s","armor":"75%","recover":"0.40s","bullets":"8","range":"26.7m","headshot":"Unreliable","helmet":"Unreliable"}},{"name":"M249","id":31,"desc":"This gun has not seen any major changes for a long time. But due to the huge change in the Negev, the M249 might be viable as a replacement for the old gun. It does slightly less damage than the Negev, but is much more accurate. But due to the incredible price tag, making it the most expensive gun in the game, it is only ever bought by accident.","game":"A strong open-area LMG, the M249 is the perfect choice for players willing to trade a slow fire rate for increased accuracy and high ammo capacity.","strategy":"If you do use this, it should be used exactly like you might think: in an open area with little cover and preferably down a corridor. There's no real secret here. If you bought it by accident, buy a rifle if you still can.","stat":{"price":"$5200","award":"$300","damage":"32","rpm":"750","ammo":"100/200","speed":"81%","accuracy":"15.7m","reload":"5.70s","armor":"80%","recover":"0.83s","range":"156m","headshot":"77.2m","helmet":"7.42m"}},{"name":"Negev","id":32,"desc":"Since it's nerf/buff or whatever, the Negev is very awkward to use. It only works in tight spaces where opponents can't exactly move and target your tracers, and when you've expended your ammo, you are a sitting duck. The Negev used to be situational, now it is extremely situational. Something fun to do is spray down mid doors on Dust 2 as the Terrorists and you're guaranteed to land shots on any CTs dumb enough to cross.","game":"The Negev is a beast that can keep the enemy at bay with its pin-point supressive fire, provided you have the luxury of time to gain control over it.","strategy":"Treat this like a really nice sports car, you have to rev it up before actually shooting down the road, and don't stop going no matter what. You literally need to shoot this thing non-stop because that's exactly what it's designed for. Then again, you probably don't care about winning the round that much if you bought this anyway.","stat":{"price":"$2000","award":"$300","damage":"35","rpm":"800","ammo":"150/300","speed":"63%","accuracy":"12.5m","reload":"5.70s","armor":"75%","recover":"3.00s","range":"156m","headshot":"105m","helmet":"15.3m"}}],"smg":[{"name":"MAC-10","id":21,"desc":"This would be the ideal Anti-ECO weapon for the Terrorist, if the Counter-Terrorists didn't have such a strong pistol. The MAC-10 is more often found to be used by annoyed Terrorists who keep losing when the Counter-Terrorists push them, since it deals with CQC and is the cheapest solution to halting these pushes. It really is meant to put as many bullets into a target as possible, without sacrificing a lot of damage or money.","game":"Essentially a box that bullets come out of, the MAC-10 SMG boasts a high rate of fire, with poor spread accuracy and high recoil as trade-offs.","strategy":"With only 2.25 seconds of bullets, this gun literally takes longer to reload that the clip will last. This is great for spraying corners, just don't start too soon. Because this gun has the lowest running inaccuracy for the SMGs, you really have no reason to NOT run-and-gun.","stat":{"price":"$1050","award":"$600","damage":"29","rpm":"800","ammo":"30/100","speed":"100%","accuracy":"11.0m","reload":"2.57s","armor":"57.5%","recover":"0.40s","range":"68.6m","headshot":"6.3m","helmet":"N/A"}},{"name":"MP9","id":22,"desc":"The fastest, the most accurate, and the lowest damage falloff of all the SMGs, and exclusive to the Counter-Terrorist. Don't be fooled though, it also has the lowest damage of all SMGs. This makes it very accurate at the expense of damage. The Counter-Terrorist should take care to aim for the head, and to let the enemy get to medium range before engaging.","game":"Manufactured in Switzerland, the cutting-edge MP9 SMG is an ergonomic polymer weapon favored by private security firms.","strategy":"Tap firing at medium ranges is the best use for this SMG, and then spraying when the enemies have gotten very close. This fits the CT play-style very well, so using this like a rifle at close-medium ranges and playing defensively is your best bet with this SMG.","stat":{"price":"$1250","award":"$600","damage":"26","rpm":"857","ammo":"30/120","speed":"100%","accuracy":"15.9m","reload":"2.13s","armor":"60%","recover":"0.26s","range":"68.6m","headshot":"2.7m","helmet":"N/A"}},{"name":"MP7","id":23,"desc":"The MP7 has high damage, high accuracy, and is effectively the next best thing to the MAC-10 and the MP9. If you are willing to spend some extra cash, opt for the MP7 as your SMG of choice for all-around better stats.","game":"Versatile but expensive, the German-made MP7 SMG is the perfect choice for high-impact close-range combat.","strategy":"Use this like you would the MP9, and know that it hits strong like the MAC-10. Most effective tapping at medium range, and spraying in close quarters.","stat":{"price":"$1700","award":"$600","damage":"29","rpm":"750","ammo":"30/120","speed":"92%","accuracy":"14.4m","reload":"3.13s","armor":"62.5%","recover":"0.44s","range":"68.6m","headshot":"8.7m","helmet":"N/A"}},{"name":"UMP-45","id":24,"desc":"This SMG used to hold the title of \"The $1200 rifle,\" but now it's high damage falloff has reduced this to a deadly close-range monster. This gun acts just like any rifle at close ranges, and still holds the longest headshot range of all SMGs.","game":"The misunderstood middle child of the SMG family, the UMP45's small magazine is the only drawback to an otherwise versatile close-quarters automatic.","strategy":"It shines the most when used in close-medium range and is aimed for the head. This is still the best option for cash-strapped players, and the accurate player can still easily go toe-to-toe with rifles.","stat":{"price":"$1200","award":"$600","damage":"35","rpm":"667","ammo":"25/100","speed":"96%","accuracy":"10.6m","reload":"3.43s","armor":"65%","recover":"0.35s","range":"70.5m","headshot":"11.1m","helmet":"N/A"}},{"name":"P90","id":25,"desc":"Despite what you might think, the P90 isn't as effective as it should be for the large price tag. Even the PP-Bizon is a better buy for it's lower cost. The P90 has the second worst accuracy and the lowest damage of the SMGs. It also has a $300 kill award. Don't waste your money on this, the Galil and FAMAS are far better alternatives.","game":"Easily recognizable for its unique bullpup design, the P90 a great weapon to shoot on the move due to its high-capacity magazine and low recoil.","strategy":"Despite CS: GO's outdated description and <b>*hilarious*</b> grammatical error (they actually say \"the P90 a great weapon\" in the real in-game description), this SMG has THE WORST running inaccuracy of all SMGs, and the recoil isn't great either. The strategy with this gun is to instead buy a Galil AR or FAMAS with a flashbang.","stat":{"price":"$2350","award":"$300","damage":"26","rpm":"857","ammo":"50/100","speed":"96%","accuracy":"10.4m","reload":"3.37s","armor":"69%","recover":"0.37s","range":"70.5m","headshot":"2.5m","helmet":"N/A"}},{"name":"PP-Bizon","id":26,"desc":"Despite what you might think, the PP-Bizon is a good buy for the player that likes to run and gun. Sadly, this tactic isn't very effective outside of the Silver ranks. Here's some interesting trivia: The PP-Bizon has the worse inaccuracy on ladders out of every weapon in the game. You are literally more likely to noscope someone with an AWP on a ladder than you are to hitting them with the PP-Bizon!","game":"The Bizon SMG is low-damage, but offers a uniquely designed high-capacity drum magazine that reloads quickly.","strategy":"Buy any other SMG instead.","stat":{"price":"$1400","award":"$600","damage":"27","rpm":"750","ammo":"64/120","speed":"100%","accuracy":"10.2m","reload":"2.43s","armor":"57.5%","recover":"0.33s","range":"68.6m","headshot":"3.3m","helmet":"N/A"}}],"rifle":[{"name":"Galil AR","id":10,"desc":"The Galil AR is the low-income Terrorist's favorite rifle. This is exactly what you would expect to get for it's price compared to the AK-47. Decent damage and accuracy make the Galil AR a good force-buy option.","game":"A less expensive option among the terrorist-exclusive assault rifles, the Galil AR is a serviceable weapon in medium to long-range combat.","strategy":"Treat this like you would the AK-47, the differences between the two aren't very noticeable in most situations, so long as you play aggressively. Playing defensively and picking from a distance isn't a good use for the weapon, so get closer and aim for the head.","stat":{"price":"$2000","award":"$300","damage":"30","rpm":"667","ammo":"35/90","speed":"90%","accuracy":"16.3m","reload":"3.03s","armor":"77.5%","recover":"0.54s","range":"156m","headshot":"86.0m","helmet":"N/A"}},{"name":"FAMAS","id":11,"desc":"A Counter-Terrorist exclusive variant of the Galil AR, except much worse in just about every way. Despite this, the FAMAS is often used in Counter-Terrorist force buys since it is basically the best thing they've got.","game":"A cheap option for cash-strapped players, the FAMAS effectively fills the niche between more expensive rifles and the less-effective SMGs.","strategy":"The FAMAS is most effective for force buys when an SMG wouldn't make the cut. Use the burst fire and control for recoil; it more than doubles the accurate range and increases RPM without sacrificing anything else.","stat":{"price":"$2250","award":"$300","damage":"30","rpm":"667","ammo":"25/90","speed":"92%","accuracy":"14.6m","reload":"3.30s","armor":"70%","recover":"0.47s","range":"156m","headshot":"42.5m","helmet":"N/A"}},{"name":"AK-47","id":12,"desc":"Arguably the best gun in the game, the Terrorist exclusive AK-47 is one of three rifles that can kill a fully armored opponent with a single headshot. It's large but controllable recoil paired with high damage makes this the one gun you need to be good at, and the one you should have the most kills with.","game":"Powerful and reliable, the AK-47 is one of the most popular assault rifles in the world. It is most deadly in short, controlled bursts of fire.","strategy":"Fast peaks and good recoil control are requirements to using the AK-47 effectively. If you know where to look, you can take down an enemy at just about any range with a single headshot in a fraction of a second.","stat":{"price":"$2700","award":"$300","damage":"36","rpm":"600","ammo":"30/90","speed":"90%","accuracy":"21.7m","reload":"2.43s","armor":"77.5%","recover":"0.37s","range":"156m","headshot":"172m","helmet":"51.7m"}},{"name":"M4A4","id":13,"desc":"The Counter-Terrorist exclusive M4 series is not easy to describe. Due to the higher price tag and defensive requirements, the M4s are often swapped for snipers, the AUG, or an SMG depending on the opposing team's strategy. Professionals may favor the M4A1-S variant, but the M4A4 still sees a fair share of use. You're choice is your own.","game":"More accurate but less damaging than its AK-47 counterpart, the M4A4 is the full-auto assault rifle of choice for CTs.","strategy":"Short bursts are most effective with this weapon, aiming at the head and controlling the recoil. Let the enemies run into your crosshair.","stat":{"price":"$3100","award":"$300","damage":"33","rpm":"667","ammo":"30/90","speed":"94%","accuracy":"27.7m","reload":"3.07s","armor":"70%","recover":"0.34s","range":"156m","headshot":"86.8m","helmet":"N/A"}},{"name":"M4A1-S","id":14,"desc":"The Counter-Terrorist exclusive M4 series is not easy to describe. Due to the higher price tag and defensive requirements, the M4s are often swapped for snipers, the AUG, or an SMG depending on the opposing team's strategy. Professionals may favor the M4A1-S variant, but the M4A4 still sees a fair share of use. You're choice is your own.","game":"With a smaller magazine than its unmuffled counterpart, the silenced M4A1 provides quieter shots with less recoil and better accuracy.","strategy":"Short bursts are most effective with this weapon, aiming at the head and controlling the recoil. Let the enemies run into your crosshair. Don't remove the silencer and keep an eye on your ammo.","stat":{"price":"$3100","award":"$300","damage":"33","rpm":"600","ammo":"20/40","speed":"94%","accuracy":"28.2m","reload":"3.07s","armor":"70%","recover":"0.34s","range":"156m","headshot":"263m","helmet":"N/A"}},{"name":"SSG 08","id":15,"desc":"The SSG 08, or more affectionately named \"Scout,\" is great for quick peeks and fast headshots. Due to its quick recovery time and high accuracy, there is no reason to *not* be moving between shots. Mastering this weapon would make it just as deadly as the Desert Eagle would be if it had a scope. It's low price tag makes it purchasable nearly every round. The accurate range is for when the weapon is and isn't scoped in.","game":"The SSG 08 bolt-action is a low-damage but very cost-effective sniper rifle, making it a smart choice for early-round long-range marksmanship.","strategy":"Stay moving and steady yourself before each shot, you will generally want to aim for the head since it will take out anyone if you land a headshot. Here's a tip: against armored opponents, stomach shots will do the most damage if you can't hit their head.","stat":{"price":"$1700","award":"$300","damage":"88","rpm":"48","ammo":"10/90","speed":"96%","accuracy":"4.8m/ 47.2m","reload":"3.70s","armor":"85%","recover":"0.14s","range":"156m","headshot":"593m","helmet":"516m"}},{"name":"SG 553","id":16,"desc":"The SG 553 is the second most accurate rifle and the only gun that completely penetrates armor. This makes it ideal for engaging from long range and effortlessly taking out anyone who stands in your way. The accurate range and mobility are for when the weapon is and isn't scoped in.","game":"The terrorist-exclusive SG553 is a premium scoped alternative to the AK47 for effective long-range engagement.","strategy":"Like CS: GO suggests, you're better off hanging back and fighting from a distance. Because of this, you should not spray this gun, and instead opt for well placed and accurate single shots. Crouching will make the SG 553 more accurate than a sniper rifle, so crouch!","stat":{"price":"$3000","award":"$300","damage":"30","rpm":"667","ammo":"30/90","speed":"88/ 63%","accuracy":"35.6m/ 61.5m","reload":"2.77s","armor":"100%","recover":"0.45s","range":"156m","headshot":"86.0m","helmet":"86.0m"}},{"name":"AUG","id":17,"desc":"The AUG is the most accurate gun in the game when scoped in, giving it the unofficial title \"The COD Gun.\" Despite how much the Terrorists will complain that it \"takes no skill\" or that you should \"use a real gun,\" you better hold onto this if you buy it. For only $200 more than an M4, it is significantly better and is capable of tearing apart the enemy team round after round with its versatility.","game":"Powerful and accurate, the AUG scoped assault rifle compensates for its long reload times with low spread and a high rate of fire.","strategy":"Although this isn't a headshot machine like the SG 553, it still deals significant damage at the longest ranges. Engage from distances and tap spam the weapon just enough that it doesn't start the recoil pattern to be deadly accurate. Crouching will make this the most accurate gun in the game, more accurate than crouching with a sniper.","stat":{"price":"$3300","award":"$300","damage":"30","rpm":"667","ammo":"30/90","speed":"92/ 63%","accuracy":"35.0m/ 63.0m","reload":"3.77s","armor":"90%","recover":"0.45s","range":"156m","headshot":"86.0m","helmet":"86.0m"}},{"name":"AWP","id":18,"desc":"With the highest damage output per shot in the game, it's no wonder you see professionals buying the AWP nearly every round that they can afford it. This monster is capable of singly holding large areas and critical choke points. It even has its own dedicated position: The AWPer. Despite this, having a team full of AWPs is typically undesirable since it becomes unreliable in close quarters.","game":"High risk and high reward, the infamous AWP is recognizable by its signature report and one-shot one-kill policy.","strategy":"This gun is guaranteed to kill in one shot to the waist or higher from effectively any distance you'll encounter in CS: GO. With the lowest RPM in the game, you will want to be very close to cover so you can hide while you chamber the next bullet. Most effective on Counter-Terrorist side, you'll need to hold angles with this gun and play the waiting game, and be quick and precise to land a shot as soon as an opponent leaps into your sights. If you ever find one on the ground, pick it up no matter what.","stat":{"price":"$4750","award":"$100","damage":"115","rpm":"41","ammo":"10/30","speed":"83/ 42%","accuracy":"1.9m/ 69.3m","reload":"3.67s","armor":"97.5%","recover":"0.35s","range":"156m","headshot":"1450m","helmet":"1420m"}},{"name":"G3SG1","id":19,"desc":"Being the Terrorist's choice of the Auto-Sniper variant, it is exactly like the SCAR-20 in every way, but with a longer reload time. There's an unspoken rule in competitive matchmaking: you never ever buy an Auto-Sniper lest you agree to an all-out Auto-War. For the sake of your own honor, do not buy this gun ever, even if the other team buys it. However, if you find an enemy Auto-Sniper on the ground, pick it up and use it against them as punishment for their war-crimes. But please, don't actually buy one.","game":"The pricy G3SG1 lowers movement speed considerably but compensates with a higher rate of fire than other sniper rifles.","strategy":"Spray corners, walls, and corridors where enemies may be. Position yourself like you would an AWP, but play much more aggressively. Don't buy this gun, the only time you should possess one is by picking it up from a fallen enemy who DID buy the gun. Please, for honor!","stat":{"price":"$5000","award":"$300","damage":"80","rpm":"240","ammo":"20/90","speed":"90/ 50%","accuracy":"5.8m/ 66.3m","reload":"4.67s","armor":"82.5%","recover":"0.54s","range":"156m","headshot":"548m","helmet":"458m"}},{"name":"SCAR-20","id":20,"desc":"Being the Counter-Terrorist's choice of the Auto-Sniper variant, it is exactly like the G3GS1 in every way, but with a much shorter reload time. There's an unspoken rule in competitive matchmaking: you never ever buy an Auto-Sniper lest you agree to an all-out Auto-War. For the sake of your own honor, do not buy this gun ever, even if the other team buys it. However, if you find an enemy Auto-Sniper on the ground, pick it up and use it against them as punishment for their war-crimes. But please, don't actually buy one.","game":"The SCAR-20 is a semi-automatic sniper rifles that trades a high rate of fire and powerful long-distance damage for sluggish movement speed and a big price tag.","strategy":"Spray corners, walls, and corridors where enemies may be. Position yourself like you would an AWP, but play much more aggressively. Don't buy this gun, the only time you should possess one is by picking it up from a fallen enemy who DID buy the gun. Please, for honor!","stat":{"price":"$5000","award":"$300","damage":"80","rpm":"240","ammo":"20/90","speed":"90/ 50%","accuracy":"5.8m/ 66.3m","reload":"3.07s","armor":"82.5%","recover":"0.54s","range":"156m","headshot":"548m","helmet":"458m"}}],"gear":[{"name":"Kevlar Vest","id":33,"desc":"Adds armor to the player, shielding only the chest from some bullet damage. Greatly reduces High Explosive Grenade damage.","game":"Body protection against projectiles and explosives.","price":"$650"},{"name":"Kevlar + Helmet","id":34,"desc":"Adds armor and helmet to the player, shielding the chest and head from some bullet damage. Greatly reduces High Explosive Grenade damage.","game":"Body and head protection against projectiles and explosives.","price":"$1000","Price With 100% Kevlar":"$350"},{"name":"Zeus x27","id":35,"desc":"A close range, single-shot, 98% of the time instant-kill weapon. Used primarily to humiliate enemies, or to annoy players during Guardian missions by being the objective. It is possible to hit a player without killing them, but it is rare as they would need to be on the cusp of the weapon's range, less than a meter from being out of range.","game":"A close range, one shot weapon that delivers a lethal dose of electricity to the target.","price":"$200","Kill Range":"3.49m","Damage Range":"4.38m"},{"name":"Defuse Kit","id":36,"desc":"This valuable equipment will reduce the time it takes to defuse a bomb to five seconds. As a Counter-Terrorist, having at least three each round will greatly increase your odds of successfully defusing bombs. If you die with this, call out its location to your teammates at an appropriate time so one of them can retrieve it.","game":"A bomb defusal kit used to speed up the bomb defusal process.","price":"$400","Defuse Time":"5.0s","Without":"10.0s"},{"name":"Rescue Kit","id":37,"desc":"This valuable equipment will reduce the time it takes to pick up hostages to two seconds. As a Counter-Terrorist, having at least three each round will greatly increase your odds of successfully rescuing hostages. If you die with this, call out its location to your teammates at an appropriate time so one of them can retrieve it.","game":"A rescue kit that's used to speed up the hostage rescue process.","price":"$400","Rescue Time":"2.0s","Without":"5.0s"}],"grenade":[{"name":"Molotov","id":38,"desc":"A glass bottle filled with gasoline and a soaked rag stuffed inside. Normally one should wrap the rag around the bottle instead so it doesn't ignite the petrol inside, so I guess the Terrorists just aren't that smart. Check out this trivia:\n\n* The Molotov's kills in about 3 seconds\n* The Molotov spreads it's flames in the direction it was initially thrown, regardless of the angle that it landed.\n* If it explodes less than 1.8m in the air above a surface, it will ignite the surface! This is slightly higher than player models (1.4m).\n* The Molotov deals damage at an increasing rate the longer you stand inside.","game":"An explosive incendiary device that covers the point of impact in flames for a short time.","price":"$400","Radius":"3.7m","Duration":"7s*","Damage":"~35/s","sub":"* Damage will only inflict for about 6.5s, leaving the flame harmless 0.25s after impact and before vanishing."},{"name":"Incendiary Grenade","id":39,"desc":"The Counter-Terrorist Incendiary Grenade is two generations ahead of the AN/M14 incendiary grenade. Their N-M16 variant uses the compound TH14, likely a dumbed-down version of Thermate-TH3, which burns hot enough to melt metal. Despite the higher numbers, their M16 grenade burns fast and relatively cooler, making it identical to the Terrorist's Molotov. See the Molotov for more info about incendiary grenades in CS: GO.","game":"An explosive incendiary device that covers the point of impact in flames for a short time.","price":"$600","Radius":"3.7m","Duration":"7s*","Damage":"~35/s","sub":"* Damage will only inflict for about 6.5s, leaving the flame harmless 0.25s after impact and before vanishing."},{"name":"Decoy Grenade","id":40,"desc":"The Decoy Grenade can be used to confuse enemies about your positions, or trick them into thinking it's a flash bang for strategic mind-games.","game":"A diversionary device that can be used to simulate weapons discharge.","price":"$50","Duration":"~15s"},{"name":"Flashbang","id":41,"desc":"Effectively the modern M84 Stun Grenade, the Flashbang is a highly versatile and effective grenade. It is capable of deafening nearby enemies and blinding those who look in the flashbang's direction, even at greater distances. Remember that just because the enemy is blind, doesn't mean they can't shoot wildly.\n\nEffect duration is given in meters, with the effect considered \"gone\" after 50% has worn off. Generally players will be blind for 2-3s if the flash was placed well.","game":"Makes a loud noise and blinding flash when thrown at enemy (pull pin first). Useful for causing distractions before entering an area.","price":"$200","1m":"~3s","2m":"2-3s","4m":"2-3s","8m":"1-2s","16m":"~1s","32m":"None"},{"name":"High Explosive Grenade","id":42,"desc":"Modeled after the M67 fragmentation grenade, this explosive deals a lot of damage and can affect many opponents that are grouped together. Best used in the early round to impede rushes, or in the late round to finish off wounded enemies in a camping location. If used correctly, it could also force players to move away from the explosion even if it wasn't close to them, tricking them into thinking an enemy may be fast approaching from its direction.\n\nDamage is given by meters from explosion, with the player standing and the grenade resting on the ground. Values are given in unarmored/ armored amounts.","game":"A high-explosive device. Pull the pin, release the spoon and throw.","price":"$300","Max Damage":"98/57","1m":"80/47","2m":"60/37","4m":"18/10","6m":"2/1"},{"name":"Smoke Grenade","id":43,"desc":"This device activates when it is at rest, so there is no need to worry about flight time. The Smoke Grenade instantly deploys after a few seconds and covers a wide cylindrical area with the upper and lower corners being slightly clipped. Good for providing light-of-sight cover to cross open areas or to hold back rushes for a few seconds. Putting a smoke down in a tight corridor, and then flashing yourself to the other side could be extremely effective to taking a group of enemies by surprise.","game":"A diversionary device that can be used to provide temporary cover for moving from place to place.","price":"$300","Inner Diameter":"3.7m","Max Diameter":"4.9m"}]}