{"basic_team_communication":"There is a reason why most games start with someone calling out &quot;Anyone got a mic?&quot; Communication via voice is fast and easy, and is arguably the most important thing to ranking up. Whether you are playing with friends or strangers, your approach to tactical communication should always be the same.<br/><br/>You still should make suggestions, but listen to your team's opinion. Try to keep talk to a minimal tactical use, arguing during a round is not only annoying but also crippling to your overall winning mentality. Talk about the next round if you lose, not how that round could've been better.<br/><br/>CS: GO is not just about aim and skill. It is also about maintaining effective communication, a winning mentality, and playing mind-games with your opponents. Below is an extensive list of many suggestions for how one should approach communication during a match.<br/><ul><li><b>Follow the Team;</b> above literally everything else, follow your team's general strategy before making suggestions. If your whole team buys, there is no reason to save just because you think it's a better choice. Act with your team first, and then offer your opinion on the next round's strategy.</li><li><b>Now is Important;</b> talk only about the current and next round. Meddling in the past is wasteful and annoying.</li><li><b>Communicate Tactically;</b> avoid arguments, and try to keep conversations short. During the round, avoid saying anything that isn't helpful to your teammates.</li><li><b>Call Out;</b> say player numbers and positions as often as possible, and when it is most helpful.</li><li><b>Ask for Support;</b> chances are that someone will come to help without questioning why you want it. Don't scream &quot;Why aren't you guys here&quot; if you are alone on a site and never asked for help.</li><li><b>Pay Attention to Yourself;</b> observe yourself first, then your enemy, and lastly your teammates. &quot;Keep your friends close, and your enemies closer.&quot;</li><li><b>Observe Enemy Patterns;</b> do they always push together, boost a certain spot, push from an odd area, buy certain guns each round? Tell your teammates as soon as you recognize a pattern in behavior, and avoid developing any patterns yourself for extended periods.</li><li><b>Support your Teammates;</b> if someone gets a good kill, clutches, or calls a strategy that wins the round, tell them about it. Your whole team will like you more when you compliment them, and improve their bias on your opinions.</li><li><b>Avoid Boasting;</b> this is mostly just annoying and will make your teammates dislike you and avoid your suggestions. Yes, that sounds counter-intuitive but it's just how the brain works.</li><li><b>Admit your Faults;</b> in relation to above, people will literally like you more and listen to you better if you admit when you fail. Yes, that is also counter-intuitive but it's just how the brain works.</li><li><b>Be Useful;</b> this ties together the three above points. Don't make suggestions if you are generally making bad suggestions, and add your opinion only if the rest of your team is listening. Talking to an audience that is clearly ignoring you or dislikes you will only waste time and will get you muted by your team.</li><li><b>Avoid Muting Teammates;</b> doing this will definitely hurt your chances of winning. Only mute those who literally do nothing but argue, complain or mic/chat-spam.</li><li><b>Don't be Annoying;</b> no one will mute you if you are only calling out positions or offering strategy without arguing against other's opinions.</li><li><b>Freeze-Time;</b> the time before each round when players can't move. Buy only when you have a strategy with your team. Say what position you want to take, and make informed suggestions on strategy.</li><li><b>Build a Winning Mentality;</b> rather than meddle in confusing strategy or controlling your team, just saying &quot;we got this&quot; is often the best you can do.</li><li><b>Build Team Moral;</b> this doesn't just include complimenting your teammates, but also avoiding bullying them when they screw up.</li><li><b>Play Mind-Games;</b> if your team wins a round with a nutty play or pure luck, type an &quot;ez&quot; into the chat. This will boost your entire team's moral (regardless of how they helped), and hurt the other team slightly. It could mean the difference between a lost game and an &quot;ez&quot; win. Just to clarify, although this can only help you, it must be done effectively. Too much smack-talk will be ineffective and could back-fire on you if you begin to lose later in the game. See <b>Effective Banter</b> for more information about smack-talking.</li><li><b>Kick Responsibly;</b> only vote to kick players when you are certain your whole team will do it. Before calling a vote, ask the rest of your team if kicking a certain player will be beneficial. In fact, CS: GO will give you a competitive cool down if you call too many failed vote-kicks.</li><li><b>Ignore Responsibly;</b> ignore teammates if they are trying to argue or offer bad advice. It might be tempting to simply mute them, but ignoring them when they say stupid stuff and listening when they call-out is very beneficial.</li></ul>","effective_banter":"Smack-talk is a simple but effective way to increase your odds of winning. A high-spirited team is generally more efficient at communication and skill than another team. Below is a list of effective tactics when it comes to talking to your opponents.<br/><ul><li><b>Use Few Words;</b> keep banter to an absolute minimum, over-doing it will have little to no effect on your opponent and could be annoying to your own team!</li><li><b>Avoid Responding;</b> if the other team types &quot;EZ&quot; into the chat, don't tell them that is was just luck or whatever. Generally, don't respond to your opponents directly.<li><b>Boost The Team;</b> rather than responding directly to the opponent, tell your team that it was lucky (even if it wasn't), and leave it at that.</li><li><b>Simple Phrases;</b> <i>ez, rekt, haha, lol, good play [sarcastic],</i> and <i>nice save [sarcastic],</i> are excellent ways to put down the other team and boost your team's moral. Specifically using short phrases is also more annoying (for the other team) than writing long text. It also can elicit a laugh from your own team by using these quips.<li><b>Warm-up;</b> get the banter started right away. Use vague remarks that don't specifically predict the outcome of the match. <i>you ready? [sarcastic], this'll be quick,</i> and <i>glhf</i> are simple and vague.<li><b>It's Just Fun;</b> don't be serious when smack-talking. Think of it as a tactic that ends with the match. Don't let it get to you at any point during or after a game, but don't exactly ignore it either. Remember, you could've been on the opposing team.</li></ul>","leading_a_team":"A team could always use a good leader, but generally the team will subconsciously decide who the leader is. Don't try to be the leader, but if you notice that you are acting like one and the rest of the team is typically listening to you, make sure you follow the suggestions listed below.<br/><ul><li><b>We;</b> Above everything, never talk directly to one player unless you are suggesting positions or asking them a question about the opponents. Try to talk to the team as a whole (including yourself) as often as you can. If you feel that you must refer to a specific player, tread lightly and don't use an accusatory tone. If you can start your sentence with &quot;We need you to...&quot;, use it.</li><li><b>Learn About The Team;</b> A good leader will try to get as much information from their team as possible. Figure out who is best at certain positions or guns.</li><li><b>Learn From The Team;</b> A better leader will ask the team about enemy patterns and pay attention to what the team is thinking.</li><li><b>Study The Enemy;</b> Pay particularly close attention to how the enemy is behaving, and focus on the bigger picture.</li><li><b>Talk to The Team as a Whole;</b> Never complain about a teammate's performance, and don't offer suggestions to a specific player. Instead, direct the suggestion to the entire team by using &quot;we&quot; instead of &quot;you.&quot;</li><li><b>Stay Cool;</b> Don't let your team know when you are getting upset or frustrated.</li><li><b>End Disputes;</b> If some teammates are arguing, don't pick a side regardless of your belief. Just telling them to &quot;stop talking about it&quot; will often be enough to end the dispute. If they begin probing you for an opinion, don't give it to them, just ignore them and change the subject to game strategy by asking the entire team what they want to do for the next round.</li><li><b>Performance;</b> Never mention any single player's performance directly to your teammates. But definitely keep track of who is doing well and who is playing poorly. Try to lift up players who appear to be giving up because they are doing badly. If you say &quot;good job,&quot; direct it to the team as a whole. Don't pick favorites.</li><li><b>Opinions;</b> If anyone ever gives an opinion about you, whether it be complimentary or accusatory, don't respond to it. The most you should say is &quot;thank you&quot; if it wouldn't put another teammate down, i.e: one player tells another to listen to you, don't respond to that.</li></ul><br/>Following these suggestions will make you an excellent leader, just don't mention it to your team. Telling them &quot;I'm trying to lead you&quot; or asking &quot;Can I be the leader?&quot; will instantly ruin their opinion of you and certainly guarantee that you will no longer be the leader (if you ever were).","basics_of_taking_sites":"As a Terrorist, you will constantly be taking sites. There are many things to keep in mind when taking a site, and compiled below is a short list of the most important factors to consider.<br/><ul><li><b>Number of CTs;</b> If you have an idea of how many Counter-Terrorists are in certain positions, relay that to your team and decide if taking the site would be easier than another route.</li><li><b>Know Your Routes;</b> Timing is everything. Keep track of possible escape routes and alternate routes, and how long it takes to traverse them, before taking a site.</li><li><b>Use Equipment;</b> Smoking off, flashing, or burning critical and common enemy positions is incredibly helpful for taking sites.</li><li><b>Assume The Worst;</b> At the beginning of matches, assume the enemy knows every sneaky spot and always holds common &amp; uncommon positions.</li><li><b>Hold Positions;</b> Once you've taken a site, don't leave it no matter what. Get into positions where every entry is being watched by more than one player, and be prepared to trade kills. Leave with the whole team if the bomb is going to explode, and put your healthiest player on bomb-watch.</li><li><b>Bomb-Watch;</b> Have the healthiest player stay in a close position where they can see the bomb clearly until there are less than five seconds to detonation. They should be just close enough to reach the defuser should a defuse be attempted. They will almost certainly have to absorb damage for this, and could lose their gun defending the bomb.</li></ul><br/>No round is always the same, and your tactics for taking sites can and should change based on the situation. These are just a few key strategy points to keep in mind when taking sites.","basics_of_retaking_sites":"As a Counter-Terrorist, you will certainly find yourself in unfavorable positions. Simply losing a site will dramatically decrease your odds of winning the round. But that doesn't mean it isn't impossible to take it back. Hopefully not many of your teammates died during the firefight, and hopefully some Terrorists were just as unlucky. Listed below is a short list of key points for re-taking sites.<br/><ul><li><b>Check Your Odds;</b> You should know exactly how many Terrorists are holding a site, and know how many teammates you have left. If the odds are stacked against you, it might be smarter to get exit frags than retake the site.</li><li><b>Use Every Angle;</b> The Terrorists are almost certainly confined to a small space with multiple entries. Always push into a site with full force, from many angles, and coordinate who will look where so there isn't confusion.</li><li><b>Use Equipment;</b> Hopefully you still have flashbangs or smokes, so use all of them to disorient your opponents and cut off their line-of-sight from each other. Engaging in only 1-to-1 fights is better than everyone shooting everyone at the same time.</li><li><b>Wait;</b> You might be lucky to have an incompetent, or risk-taking, Terrorist push out of the site. If you aren't prepared, this could devastate your chances. Wait a while, see if you can hear movement or a sniper's scope, and be ready for a push at any moment.</li><li><b>Don't Peek;</b> It's tempting to just &quot;check&quot; if an entry is being watched by going through it, but you really shouldn't take the chance. Always flash first, or disorient the Terrorists by running between entries and walking without ever peeking. If done right, you could make them focus on the wrong entry, or make them think more are near one entry when there isn't.</li></ul><br/>No round is always the same, and your tactics for retaking sites can and should change based on the situation. These are just a few key strategy points to keep in mind when retaking sites."}