{
    "format": {
        "name":"",
        "id":0,
        "desc":"",
        "game":"",
        "strategy":"",
        "stat":{
            "price":0,
            "award":0,
            "damage":0,
            "rpm":0,
            "ammo":"0/0",
            "speed":0,
            "accuracy":0.0,
            "reload":0.00,
            "armor":0.0,
            "recover":0.00,
            "range":0.0,
            "headshot":0.0,
            "helmet":0
        }
    },
    "pistols":[
        {
            "name":"Glock-18",
            "id":0,
            "desc":"Default pistol for Terrorists. This weapon is very good despite what you might think. Don't be tempted to buy something else on pistol rounds, the Glock-18 is generally better in every way. Opt for the Desert Eagle or P250 if you have really good aim. However, you should definitely pick up a USP-S if you find one. <i>Don't use the burst mode. Please.</i>",
            "game":"The Glock 18 is a serviceable first-round pistol that works best against unarmored opponents and is capable of firing three-round bursts.",
            "strategy":"Aim for the head, pace your shots at range, and spam when closer. If extremely close, you could use the burst mode. Trade it for a USP-S whenever you can.",
            "stat":{
                "price":200,
                "award":300,
                "damage":28,
                "rpm":400,
                "ammo":"20/120",
                "speed":100,
                "accuracy":20.0,
                "reload":2.27,
                "armor":47.0,
                "recover":0.33,
                "range":77.5,
                "headshot":10.2,
                "helmet":0
            }
        },
        {
            "name":"USP-S",
            "id":1,
            "desc":"Default pistol for Counter-Terrorists. This gun is far better than the P2000 in literally every way possible. Despite it's lower ammo capacity, you will almost never use it all. You're either bad enough to die before you even need to reload, or good enough that you won't have to reload. Also, this gun becomes WORSE than the P2000 in literally every way possible when you take the silencer off. DO NOT TAKE OFF THE SILENCER! It actually improves accuracy, reduces recoil, and eliminates tracer rounds.",
            "game":"A fan favorite from Counter-Strike Source, the Silenced USP has a detachable silencer that gives shots less recoil while suppression attention-getting noise.",
            "strategy":"Aim for the head, pace your shots at range, and spam when closer. Due to a smaller magazine and slower fire speed, you might consider aiming for body shots when very close. Never take off the silencer.",
            "stat":{
                "price":200,
                "award":300,
                "damage":35,
                "rpm":353,
                "ammo":"12/24",
                "speed":100,
                "accuracy":23.8,
                "reload":2.17,
                "armor":50.5,
                "recover":0.35,
                "range":77.5,
                "headshot":34.0,
                "helmet":0
            }
        },
        {
            "name":"P2000",
            "id":2,
            "desc":"A second option for the default Counter-Terrorist pistol. There is no reason to use this gun unless you are literally partially blind and can't possibly aim at someone's head. Use the USP-S instead, it does the same damage yet is more accurate. CS: GO is about headshots, so you should learn to get good at them by using the USP-S over this gun. Also, this gun takes 0.1s longer to reload than the USP-S.",
            "game":"Accurate and controllable, the German-made P2000 is a serviceable first-round pistol that works best against unarmored opponents.",
            "strategy":"Although you should use the USP-S instead, this gun is much better for spamming. Since it is already more inaccurate, you should spam when players are medium range or closer, and pace for headshots at long distances.",
            "stat":{
                "price":200,
                "award":300,
                "damage":35,
                "rpm":353,
                "ammo":"13/52",
                "speed":100,
                "accuracy":22.0,
                "reload":2.27,
                "armor":50.5,
                "recover":0.35,
                "range":77.5,
                "headshot":34.0,
                "helmet":0
            }
        },
        {
            "name":"Dual Berettas",
            "id":3,
            "desc":"The only time in the game where you can hold two guns at once. Good for trolling the enemy team when you are 14-0, or when you've given up and want to annoy them with lucky headshots. These guns are literally identical to a semi-auto love-child between the Galil and the Glock-18, but with crippling damage falloff, horrible accuracy range, and a reload speed slower than every rifle except the AUG: they both have a reload speed of 3.77 seconds. There is no way to actually use the Dual Berettas in a serious manner, it's meant for joking around and humiliating your enemies.",
            "game":"Firing two large-mag Berettas at once will lower accuracy and increase load times. On the bright side, you'll get to fire two large-mag Berettas at once.",
            "strategy":"The accuracy is really bad, so just spam and aim for the upper chest. If you're lucky, a stray shot will hit them square in the face. Crouch walking in a train formation with your entire team wielding these bad boys is very effective and works more often than you might think.",
            "stat":{
                "price":500,
                "award":300,
                "damage":38,
                "rpm":500,
                "ammo":"13/52",
                "speed":100,
                "accuracy":17.0,
                "reload":3.77,
                "armor":57.5,
                "recover":0.52,
                "range":77.5,
                "headshot":16.9,
                "helmet":0
            }
        },
        {
            "name":"P250",
            "id":4,
            "desc":"Good primarily as a side-arm for snipers. Useful for Anti-ECOs on the Counter-Terrorist side due to increased armor penetration, when you know the Terrorists might not have helmets or rifles. It has an ammo capacity of 1 extra bullet over the USP-S, but much lower accuracy. It might be worth the buy for skilled players on the Terrorist side, but often not a better choice on the Counter-Terrorist side for most rounds.",
            "game":"A low-recoil firearm with a high rate of fire, the P250 is a relatively inexpensive choice against armored opponents.",
            "strategy":"Use this during Anti-ECOs if your opponents don't have helmets. Since you should be engaging enemies at closer ranges with this gun, you should aim for the head since it will kill them at most close ranges. Good for spamming corners to land a pre-fire headshot. Excellent side-arm choice for snipers, although the Five-SeveN may be better in some cases.",
            "stat":{
                "price":300,
                "award":300,
                "damage":35,
                "rpm":400,
                "ammo":"13/26",
                "speed":100,
                "accuracy":13.7,
                "reload":2.27,
                "armor":77.7,
                "recover":0.35,
                "range":77.5,
                "headshot":19.7,
                "helmet":4.9
            }
        },
        {
            "name":"Tec-9",
            "id":5,
            "desc":"A Terrorist only weapon, the Tec-9 has the fire-rate of the Dual Berettas, accuracy like the AK-47, and a slightly better damage output than the Five-SeveN. This gun is more viable viable now due to it's recent buff. A good choice for Anti-ECOs as a Terrorist, even if they have helmets and rifles! More accurate than the AK-47 when tap-fired and running, this can easily knock down opponents at medium range when you can't afford a rifle.",
            "game":"An ideal pistol for the Terrorist on the move, the Tec-9 is lethal in close quarters and features a high magazine capacity.",
            "strategy":"Use this during Anti-ECOs or ECOs on the Terrorist side. Since this gun is amazing at all ranges, you should aim for the head. Good for spamming corners to land a pre-fire headshot. You must tap fire at longer ranges due to high firing inaccuracy, but that's actually really good for the trained player.",
            "stat":{
                "price":500,
                "award":300,
                "damage":33,
                "rpm":500,
                "ammo":"18/90",
                "speed":100,
                "accuracy":22.0,
                "reload":2.57,
                "armor":90.6,
                "recover":0.39,
                "range":77.5,
                "headshot":11.2,
                "helmet":7.2
            }
        },
        {
            "name":"Five Seven",
            "id":6,
            "desc":"A Counter-Terrorist only weapon, the Five-SeveN is an excellent all-around side arm. It might not have the damage potential of the Desert Eagle, but it's the next best choice. The Five-SeveN is like an upgraded P250, sporting very similar accuracy stats, more bullets, and more armor penetration.",
            "game":"Highly accurate and armor-piercing, the pricey Five-Seven is a slow-loader that compensates with a generous 20-round magazine and forgiving recoil.",
            "strategy":"Excellent for a general-use side-arm on the Counter-Terrorist side. Shoot fast, but don't spam, at any range because it has very low recoil. Don't run and gun, and make use of it's low recoil and fast recovery time.",
            "stat":{
                "price":500,
                "award":300,
                "damage":32,
                "rpm":400,
                "ammo":"20/100",
                "speed":100,
                "accuracy":13.7,
                "reload":2.27,
                "armor":91.2,
                "recover":0.20,
                "range":77.5,
                "headshot":11.2,
                "helmet":7.0
            }
        },
        {
            "name":"CZ75-Auto",
            "id":7,
            "desc":"This used to have the title \"Pocket AK\" due to it's high fire rate, high damage, and plentiful magazines. Now, it's best use is to not be used at all. You only get 2 clips for this gun, and you'll plow through all the ammo in less than 10 seconds. Since it also has the slowest reload for a pistol and longest deploy time, this is only usable to spam corners when you know there is someone hiding and you aren't in danger of losing the game in case you miss everything due to the high inaccuracy. This gun is literally an insult to the game because of how economically stupid and unusable it is; you are literally better off never buying this gun at all.",
            "game":"A fully automatic variant of the CZ75, the CZ75-Auto is the ideal short-term choice for turning the tables and gaining your opponents weapon. But with very little ammo in the magazine, strong trigger discipline is required.",
            "strategy":"This is a big risk/ moderate reward gamble. You have to rely on engaging only ONE enemy, maybe two at most, at very close range, and hopefully outgunning them with an inaccuracy comparable to spamming the Desert Eagle.",
            "stat":{
                "price":500,
                "award":100,
                "damage":33,
                "rpm":600,
                "ammo":"12/12",
                "speed":100,
                "accuracy":11.4,
                "reload":2.83,
                "armor":77.7,
                "recover":0.35,
                "range":77.5,
                "headshot":16.3,
                "helmet":1.4
            }
        },
        {
            "name":"Desert Eagle",
            "id":8,
            "desc":"Closer to a hand-cannon than a pistol, it makes you almost want to give this gun it's own classification. You'd think a gun with high damage, high accuracy, and high armor piercing sounds too good to be true, but that is everything the Desert Eagle is. With a headshot range comparable to some rifles, and high firing inaccuracy, this gun is deadliest in steady hands.",
            "game":"As expensive as it is powerful, the Desert Eagle is an iconic pistol that is difficult to master but surprisingly accurate at long range.",
            "strategy":"This is the only pistol where shooting less is preferred, as you only need one or two well placed shots to take down an enemy regardless of armoring. Timing and precision can make this deadlier than an AK-47 in the right hands. Use this like an AK-47, but say \"1 hospital, 2 hospital, 3...\" between shots, because that's where you'll be sending them.",
            "stat":{
                "price":700,
                "award":300,
                "damage":63,
                "rpm":267,
                "ammo":"7/35",
                "speed":96,
                "accuracy":24.6,
                "reload":2.20,
                "armor":93.2,
                "recover":0.81,
                "range":77.5,
                "headshot":41.8,
                "helmet":38.6
            }
        },
        {
            "name":"R8 Revolver",
            "id":9,
            "desc":"As iNoToRiOuS puts it, this gun really is the \"Desert Eagle's stupid little brother.\" It used to be the only gun you'd need in matchmaking: it had the same stats as an AWP, but a longer trigger pull. But now it isn't worth it. Despite the stats listed here, it is actually slightly more inaccurate than the Desert Eagle due to the charging mechanic. Use the Desert Eagle.",
            "game":"The R8 Revolver delivers a highly accurate and powerful round at the expense of a lengthy trigger-pull. Firing rapidly by fanning the hammer may be the best option when point-blank stopping power is required.",
            "strategy":"Literally equip the Desert Eagle instead, there is no reason to use this gun as it stands right now.",
            "stat":{
                "price":700,
                "award":300,
                "damage":86,
                "rpm":120,
                "ammo":"8/8",
                "speed":92,
                "accuracy":24.9,
                "reload":2.27,
                "armor":93.2,
                "recover":0.90,
                "range":77.5,
                "headshot":190.0,
                "helmet":179.0
            }
        }
    ]
}
